nxp-mcuxpresso/mcux-sdk/devices/MIMXRT1189/drivers/fsl_clock.c
    if (behavior == kCLOCK_1MHzOutDisable)
    {
        tmp32 |= OSC_RC_400M_CTRL3_EN_1M_CLK_MASK;
    }
    else
    {
        if (behavior == kCLOCK_1MHzOutEnableLocked1Mhz)
        {
            tmp32 |= OSC_RC_400M_CTRL3_MUX_1M_CLK_MASK;
        }
    }
    OSC_RC_400M->CTRL3.RW = tmp32;
}

/*!
 * brief Set the count for the locked 1MHz clock out.
 *
 * param count Used to set the desired target for the locked 1MHz clock out, the value in number of clock cycles of the
 * osc_out_400M per divided ref_clk.
 */
void CLOCK_OSC_SetLocked1MHzCount(uint16_t count)
{
    uint32_t tmp32;
    uint16_t targetCount;
    uint16_t hystMinus;
    uint16_t diffCount;

    tmp32       = OSC_RC_400M->CTRL1.RW;
    targetCount = (uint16_t)((tmp32 & OSC_RC_400M_CTRL1_TARGET_COUNT_MASK) >> OSC_RC_400M_CTRL1_TARGET_COUNT_SHIFT);
    hystMinus   = (uint16_t)((tmp32 & OSC_RC_400M_CTRL1_HYST_MINUS_MASK) >> OSC_RC_400M_CTRL1_HYST_MINUS_SHIFT);
    diffCount   = targetCount - hystMinus - count;

    /* The count for the locked 1MHz clock should be 4 to 8 counts less than CTRL[TARGET_COUNT] - CTRL1[HYST_MINUS]. */
    if ((diffCount >= 4U) && (diffCount <= 8U))
    {
        tmp32                 = (tmp32 & ~OSC_RC_400M_CTRL3_COUNT_1M_CLK_MASK) | OSC_RC_400M_CTRL3_COUNT_1M_CLK(count);
        OSC_RC_400M->CTRL3.RW = tmp32;
    }
}

/*!
 * brief Check the error flag for locked 1MHz clock out.
 *
 * return The error flag for locked 1MHz clock out.
 *      - \b true The count value has been reached within one diviced ref clock period
 *      - \b false No effect.
 */
bool CLOCK_OSC_CheckLocked1MHzErrorFlag(void)
{
    return ((OSC_RC_400M->STAT0 & OSC_RC_400M_STAT0_CLK1M_ERR_MASK) == OSC_RC_400M_STAT0_CLK1M_ERR_MASK);
}

/*!
 * brief Clear the error flag for locked 1MHz clock out.
 */
void CLOCK_OSC_ClearLocked1MHzErrorFlag(void)
{
    OSC_RC_400M->CTRL3.SET = OSC_RC_400M_CTRL3_CLR_ERR_MASK;
}

/*!
 * brief Get current count for the fast clock during the tune process.
 *
 * return The current count for the fast clock.
 */
uint16_t CLOCK_OSC_GetCurrentOscRc400MFastClockCount(void)
{
    return (uint16_t)((OSC_RC_400M->STAT1 & OSC_RC_400M_STAT1_CURR_COUNT_VAL_MASK) >>
                      OSC_RC_400M_STAT1_CURR_COUNT_VAL_SHIFT);
}

/*!
 * brief Get current tune value used by oscillator during tune process.
 *
 * return The current tune value.
 */
uint8_t CLOCK_OSC_GetCurrentOscRc400MTuneValue(void)
{
    return (uint8_t)((OSC_RC_400M->STAT2 & OSC_RC_400M_STAT2_CURR_OSC_TUNE_VAL_MASK) >>
                     OSC_RC_400M_STAT2_CURR_OSC_TUNE_VAL_SHIFT);
}

#ifndef GET_FREQ_FROM_OBS
static uint32_t CLOCK_GetAudioPllFreq(void)
{
    uint32_t freq = 0;
    uint32_t div;
    uint32_t post_div;
    double tmpDouble;
    double denom;
    double numer;

    div      = (AUDIO_PLL->CTRL0.RW & PLL_CTRL0_DIV_SELECT_MASK) >> PLL_CTRL0_DIV_SELECT_SHIFT;
    post_div = (AUDIO_PLL->CTRL0.RW & PLL_CTRL0_POST_DIV_SEL_MASK) >> PLL_CTRL0_POST_DIV_SEL_SHIFT;
    denom    = (double)(AUDIO_PLL->DENOMINATOR.RW);
    numer    = (double)(AUDIO_PLL->NUMERATOR.RW);

    tmpDouble = ((double)XTAL_FREQ * ((double)div + (numer / denom)) / (double)(uint32_t)(1UL << post_div));
    freq      = (uint32_t)tmpDouble;

    return freq;
}
#endif

uint32_t CLOCK_GetPllFreq(clock_pll_t pll)
{
    uint32_t freq = 0;
#ifndef GET_FREQ_FROM_OBS
    uint32_t divSelect, postDiv;
#endif

    switch (pll)
    {
        case kCLOCK_PllArm:
#ifndef GET_FREQ_FROM_OBS
            divSelect = (ANADIG_PLL->ARM_PLL_CTRL & ANADIG_PLL_ARM_PLL_CTRL_DIV_SELECT_MASK) >>
                        ANADIG_PLL_ARM_PLL_CTRL_DIV_SELECT_SHIFT;
            postDiv = (ANADIG_PLL->ARM_PLL_CTRL & ANADIG_PLL_ARM_PLL_CTRL_POST_DIV_SEL_MASK) >>
                      ANADIG_PLL_ARM_PLL_CTRL_POST_DIV_SEL_SHIFT;
            postDiv = (1UL << (postDiv + 1UL));
            freq    = XTAL_FREQ / (2UL * postDiv);
            freq *= divSelect;
#else
            freq = CLOCK_GetFreqFromObs(0, CCM_OBS_PLL_ARM_OUT);
#endif
            break;
        case kCLOCK_PllSys1:
#ifndef GET_FREQ_FROM_OBS
            freq = PLL_SYS1_1G_FREQ;
#else
            freq = CLOCK_GetFreqFromObs(0, CCM_OBS_PLL_1G_OUT);
#endif
            break;
        case kCLOCK_PllSys2:
#ifndef GET_FREQ_FROM_OBS
            freq = PLL_SYS2_528_FREQ;
#else
            freq = CLOCK_GetFreqFromObs(0, CCM_OBS_PLL_528_OUT);
#endif
            break;
        case kCLOCK_PllSys3:
#ifndef GET_FREQ_FROM_OBS
            freq = PLL_SYS3_480_FREQ;
#else
            freq = CLOCK_GetFreqFromObs(0, CCM_OBS_PLL_480_OUT);
#endif
            break;
        case kCLOCK_PllAudio:
#ifndef GET_FREQ_FROM_OBS
            freq = CLOCK_GetAudioPllFreq();
#else
            freq = CLOCK_GetFreqFromObs(0, CCM_OBS_PLL_AUDIO_OUT);
#endif
            break;
        default:
            /* Wrong input parameter pll. */
            assert(false);
            break;
    }
    return freq;
}

uint32_t CLOCK_GetFreq(clock_name_t name)
{
    uint32_t freq = 0;
    switch (name)
    {
        case kCLOCK_OscRc24M:
#ifndef GET_FREQ_FROM_OBS
            freq = 24000000U;
#else
            freq = CLOCK_GetFreqFromObs(0, CCM_OBS_OSC_RC_24M);
#endif
            break;
        case kCLOCK_OscRc400M:
#ifndef GET_FREQ_FROM_OBS
            freq = 400000000U;
#else
            freq = CLOCK_GetFreqFromObs(0, CCM_OBS_OSC_RC_400M);
#endif
            break;
        case kCLOCK_Osc24MOut:
        case kCLOCK_Osc24M:
#ifndef GET_FREQ_FROM_OBS
            freq = 24000000U;
#else
            freq = CLOCK_GetFreqFromObs(0, CCM_OBS_OSC_24M_OUT);
#endif
            break;
        case kCLOCK_ArmPllOut:
        case kCLOCK_ArmPll:
            freq = CLOCK_GetPllFreq(kCLOCK_PllArm);
            break;
        case kCLOCK_SysPll2:
        case kCLOCK_SysPll2Out:
            freq = CLOCK_GetPllFreq(kCLOCK_PllSys2);
            break;
        case kCLOCK_SysPll2Pfd0:
            freq = CLOCK_GetPfdFreq(kCLOCK_PllSys2, kCLOCK_Pfd0);
            break;
        case kCLOCK_SysPll2Pfd1:
            freq = CLOCK_GetPfdFreq(kCLOCK_PllSys2, kCLOCK_Pfd1);
            break;
        case kCLOCK_SysPll2Pfd2:
            freq = CLOCK_GetPfdFreq(kCLOCK_PllSys2, kCLOCK_Pfd2);
            break;
        case kCLOCK_SysPll2Pfd3:
            freq = CLOCK_GetPfdFreq(kCLOCK_PllSys2, kCLOCK_Pfd3);
            break;
        case kCLOCK_SysPll3Out:
        case kCLOCK_SysPll3:
            freq = CLOCK_GetPllFreq(kCLOCK_PllSys3);
            break;
        case kCLOCK_SysPll3Div2:
            freq = (CLOCK_GetPllFreq(kCLOCK_PllSys3) / 2UL);
            break;
        case kCLOCK_SysPll3Pfd0:
            freq = CLOCK_GetPfdFreq(kCLOCK_PllSys3, kCLOCK_Pfd0);
            break;
        case kCLOCK_SysPll3Pfd1:
            freq = CLOCK_GetPfdFreq(kCLOCK_PllSys3, kCLOCK_Pfd1);
            break;
        case kCLOCK_SysPll3Pfd2:
            freq = CLOCK_GetPfdFreq(kCLOCK_PllSys3, kCLOCK_Pfd2);
            break;
        case kCLOCK_SysPll3Pfd3:
            freq = CLOCK_GetPfdFreq(kCLOCK_PllSys3, kCLOCK_Pfd3);
            break;
        case kCLOCK_SysPll1:
        case kCLOCK_SysPll1Out:
            freq = CLOCK_GetPllFreq(kCLOCK_PllSys1);
            break;
        case kCLOCK_SysPll1Div2:
            freq = CLOCK_GetPllFreq(kCLOCK_PllSys1) / 2UL;
            break;
        case kCLOCK_SysPll1Div5:
            freq = CLOCK_GetPllFreq(kCLOCK_PllSys1) / 5UL;
            break;
        case kCLOCK_AudioPll:
        case kCLOCK_AudioPllOut:
            freq = CLOCK_GetPllFreq(kCLOCK_PllAudio);
            break;
        case kCLOCK_CpuClk:
        case kCLOCK_CoreSysClk:
            freq = CLOCK_GetCpuClkFreq();
            break;
        default:
            /* Wrong input parameter name. */
            assert(false);
            break;
    }
    assert(freq != 0UL);
    return freq;
}

/*!
 * @brief Get the CCM CPU/core/system frequency.
 *
 * @return  Clock frequency; If the clock is invalid, returns 0.
 */
uint32_t CLOCK_GetM7Freq(void)
{
    uint32_t freq = 0, mux;
    mux           = CLOCK_GetRootClockMux(kCLOCK_Root_M7);

    switch (s_clockSourceName[kCLOCK_Root_M7][mux])
    {
        case kCLOCK_OscRc24M:
#ifndef GET_FREQ_FROM_OBS
            freq = 24000000U;
#else
            freq = CLOCK_GetFreqFromObs(0, CCM_OBS_OSC_RC_24M);
#endif
            break;
        case kCLOCK_OscRc400M:
#ifndef GET_FREQ_FROM_OBS
            freq = 400000000U;
#else
            freq = CLOCK_GetFreqFromObs(0, CCM_OBS_OSC_RC_400M);
#endif
            break;
        case kCLOCK_ArmPllOut:
            freq = CLOCK_GetPllFreq(kCLOCK_PllArm);
            break;
        case kCLOCK_SysPll3Out:
            freq = CLOCK_GetPllFreq(kCLOCK_PllSys3);
            break;
        default:
            /* Wrong input parameter name. */
            assert(false);
            break;
    }
    freq = freq / (CLOCK_GetRootClockDiv(kCLOCK_Root_M7));
    assert(freq);
    return freq;
}

/*!
 * @brief Get the CCM CPU/core/system frequency.
 *
 * @return  Clock frequency; If the clock is invalid, returns 0.
 */
uint32_t CLOCK_GetM33Freq(void)
{
    uint32_t freq = 0, mux;
    mux           = CLOCK_GetRootClockMux(kCLOCK_Root_M33);

    switch (s_clockSourceName[kCLOCK_Root_M33][mux])
    {
        case kCLOCK_OscRc24M:
#ifndef GET_FREQ_FROM_OBS
            freq = 24000000U;
#else
            freq = CLOCK_GetFreqFromObs(0, CCM_OBS_OSC_RC_24M);
#endif
            break;
        case kCLOCK_OscRc400M:
#ifndef GET_FREQ_FROM_OBS
            freq = 400000000U;
#else
            freq = CLOCK_GetFreqFromObs(0, CCM_OBS_OSC_RC_400M);
#endif
            break;
        case kCLOCK_ArmPllOut:
            freq = CLOCK_GetPllFreq(kCLOCK_PllArm);
            break;
        case kCLOCK_SysPll3Out:
            freq = CLOCK_GetPllFreq(kCLOCK_PllSys3);
            break;
        default:
            /* Wrong input parameter name. */
            assert(false);
            break;
    }
    freq = freq / (CLOCK_GetRootClockDiv(kCLOCK_Root_M33));
    assert(freq);
    return freq;
}

void CLOCK_SetClockSourceControlMode(clock_name_t name, clock_control_mode_t controlMode)
{
    switch (name)
    {
        case kCLOCK_OscRc24M:
            ANADIG_OSC->OSC_RC24M_CTRL =
                (ANADIG_OSC->OSC_RC24M_CTRL & ~(ANADIG_OSC_OSC_RC24M_CTRL_RC_24M_CONTROL_MODE_MASK)) |
                ANADIG_OSC_OSC_RC24M_CTRL_RC_24M_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_OscRc400M:
            ANADIG_OSC->OSC_400M_CTRL1 =
                (ANADIG_OSC->OSC_400M_CTRL1 & (~ANADIG_OSC_OSC_400M_CTRL1_RC_400M_CONTROL_MODE_MASK)) |
                ANADIG_OSC_OSC_400M_CTRL1_RC_400M_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_Osc24MOut:
        case kCLOCK_Osc24M:
            ANADIG_OSC->OSC_24M_CTRL =
                (ANADIG_OSC->OSC_24M_CTRL & ~(ANADIG_OSC_OSC_24M_CTRL_OSC_24M_CONTROL_MODE_MASK)) |
                ANADIG_OSC_OSC_24M_CTRL_OSC_24M_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_ArmPllOut:
        case kCLOCK_ArmPll:
            ANADIG_PLL->ARM_PLL_CTRL =
                (ANADIG_PLL->ARM_PLL_CTRL & ~(ANADIG_PLL_ARM_PLL_CTRL_ARM_PLL_CONTROL_MODE_MASK)) |
                ANADIG_PLL_ARM_PLL_CTRL_ARM_PLL_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll2:
        case kCLOCK_SysPll2Out:
            ANADIG_PLL->SYS_PLL2_CTRL =
                (ANADIG_PLL->SYS_PLL2_CTRL & ~(ANADIG_PLL_SYS_PLL2_CTRL_SYS_PLL2_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL2_CTRL_SYS_PLL2_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll2Pfd0:
            ANADIG_PLL->SYS_PLL2_UPDATE =
                (ANADIG_PLL->SYS_PLL2_UPDATE & ~(ANADIG_PLL_SYS_PLL2_UPDATE_PFD0_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL2_UPDATE_PFD0_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll2Pfd1:
            ANADIG_PLL->SYS_PLL2_UPDATE =
                (ANADIG_PLL->SYS_PLL2_UPDATE & ~(ANADIG_PLL_SYS_PLL2_UPDATE_PFD1_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL2_UPDATE_PFD1_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll2Pfd2:
            ANADIG_PLL->SYS_PLL2_UPDATE =
                (ANADIG_PLL->SYS_PLL2_UPDATE & ~(ANADIG_PLL_SYS_PLL2_UPDATE_PFD2_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL2_UPDATE_PFD2_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll2Pfd3:
            ANADIG_PLL->SYS_PLL2_UPDATE =
                (ANADIG_PLL->SYS_PLL2_UPDATE & ~(ANADIG_PLL_SYS_PLL2_UPDATE_PFD3_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL2_UPDATE_PFD3_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll3Out:
        case kCLOCK_SysPll3:
            ANADIG_PLL->SYS_PLL3_CTRL =
                (ANADIG_PLL->SYS_PLL3_CTRL & ~(ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll3Div2:
            ANADIG_PLL->SYS_PLL3_CTRL =
                (ANADIG_PLL->SYS_PLL3_CTRL & ~(ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_DIV2_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_DIV2_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll3Pfd0:
            ANADIG_PLL->SYS_PLL3_UPDATE =
                (ANADIG_PLL->SYS_PLL3_UPDATE & ~(ANADIG_PLL_SYS_PLL3_UPDATE_PFD0_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL3_UPDATE_PFD0_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll3Pfd1:
            ANADIG_PLL->SYS_PLL3_UPDATE =
                (ANADIG_PLL->SYS_PLL3_UPDATE & ~(ANADIG_PLL_SYS_PLL3_UPDATE_PFD1_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL3_UPDATE_PFD1_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll3Pfd2:
            ANADIG_PLL->SYS_PLL3_UPDATE =
                (ANADIG_PLL->SYS_PLL3_UPDATE & ~(ANADIG_PLL_SYS_PLL3_UPDATE_PFD2_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL3_UPDATE_PFD2_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll3Pfd3:
            ANADIG_PLL->SYS_PLL3_UPDATE =
                (ANADIG_PLL->SYS_PLL3_UPDATE & ~(ANADIG_PLL_SYS_PLL3_UPDATE_PFD3_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL3_UPDATE_PFD3_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll1:
        case kCLOCK_SysPll1Out:
            ANADIG_PLL->SYS_PLL1_CTRL =
                (ANADIG_PLL->SYS_PLL1_CTRL & ~(ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll1Div2:
            ANADIG_PLL->SYS_PLL1_CTRL =
                (ANADIG_PLL->SYS_PLL1_CTRL & ~(ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_DIV2_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_DIV2_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_SysPll1Div5:
            ANADIG_PLL->SYS_PLL1_CTRL =
                (ANADIG_PLL->SYS_PLL1_CTRL & ~(ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_DIV5_CONTROL_MODE_MASK)) |
                ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_DIV5_CONTROL_MODE(controlMode);
            break;
        case kCLOCK_AudioPll:
        case kCLOCK_AudioPllOut:
            ANADIG_PLL->PLL_AUDIO_CTRL =
                (ANADIG_PLL->PLL_AUDIO_CTRL & ~(ANADIG_PLL_PLL_AUDIO_CTRL_PLL_AUDIO_CONTROL_MODE_MASK)) |
                ANADIG_PLL_PLL_AUDIO_CTRL_PLL_AUDIO_CONTROL_MODE(controlMode);
            break;
        default:
            /* Wrong input parameter name. */
            assert(false);
            break;
    }
}

void CLOCK_OSC_TrimOscRc400M(bool enable, bool bypass, uint16_t trim)
{
    if (enable)
    {
        OSC_RC_400M->CTRL2.CLR = OSC_RC_400M_CTRL2_OSC_TUNE_VAL_MASK | OSC_RC_400M_CTRL2_TUNE_BYP_MASK;
        OSC_RC_400M->CTRL2.SET = OSC_RC_400M_CTRL2_OSC_TUNE_VAL(trim) | OSC_RC_400M_CTRL2_TUNE_BYP(bypass);
    }
}

void CLOCK_OSC_EnableOscRc400M(void)
{
    ANADIG_OSC->OSC_400M_CTRL1 &= ~ANADIG_OSC_OSC_400M_CTRL1_PWD_MASK;
}

/* Note: If this function gets invoked in different core's application, user should use different obsIndex in case
 * register access conflicts. */
uint32_t CLOCK_GetFreqFromObs(uint8_t obsIndex, uint32_t obsSigIndex)
{
    CCM->OBSERVE[obsIndex].CONTROL     = CCM_OBSERVE_CONTROL_OFF_MASK;   /* turn off detect */
    CCM->OBSERVE[obsIndex].CONTROL_SET = CCM_OBSERVE_CONTROL_RESET_MASK; /* reset slice */
    CCM->OBSERVE[obsIndex].CONTROL_CLR = CCM_OBSERVE_CONTROL_RAW_MASK;   /* select raw obsSigIndex */
    CCM->OBSERVE[obsIndex].CONTROL &= ~CCM_OBSERVE_CONTROL_SELECT_MASK;  /* Select observed obsSigIndex */
    CCM->OBSERVE[obsIndex].CONTROL |=
        CCM_OBSERVE_CONTROL_SELECT(obsSigIndex) | CCM_OBSERVE_CONTROL_DIVIDE(CCM_OBS_DIV); /* turn on detection */
    CCM->OBSERVE[obsIndex].CONTROL_CLR =
        CCM_OBSERVE_CONTROL_RESET_MASK | CCM_OBSERVE_CONTROL_OFF_MASK; /* unreset and turn on detect */

    while (CCM->OBSERVE[obsIndex].FREQUENCY_CURRENT == 0UL)
    {
    }

    return (CCM->OBSERVE[obsIndex].FREQUENCY_CURRENT * ((uint32_t)CCM_OBS_DIV + 1UL));
}

#if !(defined(MIMXRT1181_SERIES) || defined(MIMXRT1182_SERIES))
/*! brief Enable USB HS clock.
 *
 * This function only enables the access to USB HS prepheral, upper layer
 * should first call the ref CLOCK_EnableUsbhs0PhyPllClock to enable the PHY
 * clock to use USB HS.
 *
 * param src  USB HS does not care about the clock source, here must be ref kCLOCK_UsbSrcUnused.
 * param freq USB HS does not care about the clock source, so this parameter is ignored.
 * retval true The clock is set successfully.
 * retval false The clock source is invalid to get proper USB HS clock.
 */
bool CLOCK_EnableUsbhs0Clock(clock_usb_src_t src, uint32_t freq)
{
    return true;
}
/*! brief Enable USB HS PHY PLL clock.
 *
 * This function enables the internal 480MHz USB PHY PLL clock.
 *
 * param src  USB HS PHY PLL clock source.
 * param freq The frequency specified by src.
 * retval true The clock is set successfully.
 * retval false The clock source is invalid to get proper USB HS clock.
 */
bool CLOCK_EnableUsbhs0PhyPllClock(clock_usb_phy_src_t src, uint32_t freq)
{
    uint32_t phyPllDiv  = 0U;
    uint16_t multiplier = 0U;
    bool err            = false;
    CLOCK_EnableClock(kCLOCK_Usb);

